src/Catalogs/ПоказателиСчетчиков/ПоказателиСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиСчетчиков</name>
  <owners>Catalog.ПоказателиМониторинга</owners>
  <owners>Catalog.ПоказателиОповещений</owners>
  <owners>Catalog.ПоказателиИнцидентов</owners>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТипаПоказателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикиВыбран</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикиРежимВыбора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Счетчики</name>
    <attributes>
      <name>Счетчик</name>
      <type>
        <types>CatalogRef.ГруппыСчетчиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АвтовыборПараметры</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеУсловия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеСоединения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПрофильМониторинга/ПрофильМониторинга.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофильМониторинга</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Онлайн</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автообновление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоТочек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСдвига</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяНастройка</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиаграммы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АнализПоказателейЧислоКолонок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗаголовкаТекущейТочки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеЗаголовкаТекущейТочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КаждыйПоказательОтдельно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйШагОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОтображенияПрофиляПриРотации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПроверкиВыпоненияФоновогоЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПорядокПоказателей</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьНаДиаграмме</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомасштаб</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Масштаб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>8</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьДанныеЗаПрошлыйПериод</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВременноеСмещение</name>
      <type>
        <types>EnumRef.ВариантыСмещенияВременногоОкна</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьТренд</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУсредняемыхЗначений</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЛинии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипСглаживания</name>
      <type>
        <types>EnumRef.ТипыСглаживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолщинаЛинии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиМониторинга</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаПоказателя</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Быстрый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиПоказателей</name>
    <attributes>
      <name>УИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыДиаграммАнализДиаграмм</name>
    <attributes>
      <name>ИдентификаторТипаПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДиаграммы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/УдалениеНеактуальныхДанных/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПроверитьВозможностьУдаленияГруппыСчетчиков(ГруппаСчетчиков) Экспорт 
	
	ВозможноУдалять = Истина;
	
	Выборка = ПолучитьПоказателиСчетчиковПоГруппеСчетчиков(ГруппаСчетчиков);
	
	Пока Выборка.Следующий() И ВозможноУдалять Цикл
		ПоказательСчетчиковОбъект = Выборка.ПоказательСчетчиков.ПолучитьОбъект();
		
		Отбор = Новый Структура("Счетчик", ГруппаСчетчиков);
		СтрокиМассив = ПоказательСчетчиковОбъект.Счетчики.НайтиСтроки(Отбор);
		Если ПоказательСчетчиковОбъект.Счетчики.Количество() = СтрокиМассив.Количество() Тогда
			Если ТипЗнч(Выборка.ПоказательСчетчиков.Владелец) = Тип("СправочникСсылка.ПоказателиМониторинга") Тогда
				ЕстьПрофили = ЕстьПрофилиМониторингаПоПоказателю(Выборка.ПоказательСчетчиков.Владелец);
				Если ЕстьПрофили Тогда 
					ВозможноУдалять = Ложь;
					Прервать;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ВозможноУдалять;
	
КонецФункции

Функция ПолучитьПоказателиСчетчиковПоГруппеСчетчиков(ГруппаСчетчиков) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоказателиСчетчиковСчетчики.Ссылка КАК ПоказательСчетчиков
	|ИЗ
	|	Справочник.ПоказателиСчетчиков.Счетчики КАК ПоказателиСчетчиковСчетчики
	|ГДЕ
	|	ПоказателиСчетчиковСчетчики.Счетчик = &ГруппаСчетчиков
	|";
	
	Запрос.УстановитьПараметр("ГруппаСчетчиков", ГруппаСчетчиков);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	
	Возврат Выборка;
	
КонецФункции

Процедура УдалитьПоказательСчетчиковИзПоказателиМониторинга(Знач Ссылка) Экспорт
	
	Выборка = ПолучитьПоказательМониторингаПоПоказателю(Ссылка); 
	
	Пока Выборка.Следующий() Цикл
		ПоказательМониторингаОбъект = Выборка.ПоказательМониторинга.ПолучитьОбъект();
		ПоказательМониторингаОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры

Функция	ЕстьПрофилиМониторингаПоПоказателю(Показатель) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПрофильМониторингаПорядокПоказателей.Ссылка
	|ИЗ
	|	Справочник.ПрофильМониторинга.ПорядокПоказателей КАК ПрофильМониторингаПорядокПоказателей
	|ГДЕ
	|	ПрофильМониторингаПорядокПоказателей.Показатель = &Показатель
	|	И ПрофильМониторингаПорядокПоказателей.Ссылка <> &ПрофильМониторинга";
	Запрос.УстановитьПараметр("Показатель", Показатель);
	Запрос.УстановитьПараметр("ПрофильМониторинга", Показатель.Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьПрофили = Не РезультатЗапроса.Пустой(); 
	
	Возврат ЕстьПрофили;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПоказательМониторингаПоПоказателю(Показатель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПоказателиМониторинга.Ссылка КАК ПоказательМониторинга
	|ИЗ
	|	Справочник.ПоказателиМониторинга КАК ПоказателиМониторинга
	|ГДЕ
	|	ПоказателиМониторинга.Показатель = &Показатель
	|";
	Запрос.УстановитьПараметр("Показатель", Показатель);
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

#КонецОбласти
